---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOverlap
source: html/ce1d3f12-bc14-ed2f-262b-8021e9522432.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesOverlap Property

Overlapping gridlines should be avoided, unless there are only two and one is host type dependent and the other is not.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridlinesOverlap { get; }
```